<a href="https://colab.research.google.com/github/CarohN/SQL/blob/main/ABC_DATA.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!pip install pymysql

In [2]:
%load_ext sql

In [3]:
%sql sqlite:////content/ABC_DATA.db

In [ ]:
%%sql
CREATE TABLE customers(
    customer_id integer PRIMARY KEY,
    first_name varchar (20),
    last_name varchar (20),
    email varchar (20)
);

In [ ]:
%%sql INSERT INTO customers (customer_id, first_name, last_name, email) VALUES
    (1, 'John', 'Doe', 'johndoe@email.com'),
    (2, 'Jane', 'Smith', 'janesmith@email.com'),
    (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
    (4, 'Alice', 'Brown', 'alicebrown@email.com'),
    (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
    (6, 'Eva', 'Fisher', 'evafisher@email.com'),
    (7, 'George', 'Harris', 'georgeharris@email.com'),
    (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
    (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
    (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
    (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
    (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
    (13, 'Sophia', 'Thomas', 'sophiathomas@email.com');

In [7]:
%%sql SELECT *
FROM customers

 * sqlite:////content/ABC_DATA.db
Done.

[(1, 'John', 'Doe', 'johndoe@email.com'),
 (2, 'Jane', 'Smith', 'janesmith@email.com'),
 (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
 (4, 'Alice', 'Brown', 'alicebrown@email.com'),
 (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
 (6, 'Eva', 'Fisher', 'evafisher@email.com'),
 (7, 'George', 'Harris', 'georgeharris@email.com'),
 (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
 (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
 (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
 (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
 (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
 (13, 'Sophia', 'Thomas', 'sophiathomas@email.com')]

In [ ]:
%%sql
CREATE TABLE products(
  product_id integer PRIMARY KEY,
  product_name varchar (20),
  price DECIMAL (4,2)
);

In [ ]:
%%sql INSERT INTO products (product_id, product_name, price) VALUES
    (1, 'Product A', 10.00),
    (2, 'Product B', 15.00),
    (3, 'Product C', 20.00),
    (4, 'Product D', 25.00),
    (5, 'Product E', 30.00),
    (6, 'Product F', 35.00),
    (7, 'Product G', 40.00),
    (8, 'Product H', 45.00),
    (9, 'Product I', 50.00),
    (10, 'Product J', 55.00),
    (11, 'Product K', 60.00),
    (12, 'Product L', 65.00),
    (13, 'Product M', 70.00);

In [10]:
%%sql SELECT *
FROM products

 * sqlite:////content/ABC_DATA.db
Done.

[(1, 'Product A', 10),
 (2, 'Product B', 15),
 (3, 'Product C', 20),
 (4, 'Product D', 25),
 (5, 'Product E', 30),
 (6, 'Product F', 35),
 (7, 'Product G', 40),
 (8, 'Product H', 45),
 (9, 'Product I', 50),
 (10, 'Product J', 55),
 (11, 'Product K', 60),
 (12, 'Product L', 65),
 (13, 'Product M', 70)]

In [ ]:
%%sql
CREATE TABLE orders (
  order_id integer PRIMARY KEY,
  customer_id INT,
  order_date DATE
)

In [ ]:
%%sql INSERT INTO orders (order_id, customer_id, order_date) VALUES
    (1, 1, '2023-05-01'),
    (2, 2, '2023-05-02'),
    (3, 3, '2023-05-03'),
    (4, 1, '2023-05-04'),
    (5, 2, '2023-05-05'),
    (6, 3, '2023-05-06'),
    (7, 4, '2023-05-07'),
    (8, 5, '2023-05-08'),
    (9, 6, '2023-05-09'),
    (10, 7, '2023-05-10'),
    (11, 8, '2023-05-11'),
    (12, 9, '2023-05-12'),
    (13, 10, '2023-05-13'),
    (14, 11, '2023-05-14'),
    (15, 12, '2023-05-15'),
    (16, 13, '2023-05-16');

In [13]:
%%sql SELECT *
FROM orders

 * sqlite:////content/ABC_DATA.db
Done.

[(1, 1, '2023-05-01'),
 (2, 2, '2023-05-02'),
 (3, 3, '2023-05-03'),
 (4, 1, '2023-05-04'),
 (5, 2, '2023-05-05'),
 (6, 3, '2023-05-06'),
 (7, 4, '2023-05-07'),
 (8, 5, '2023-05-08'),
 (9, 6, '2023-05-09'),
 (10, 7, '2023-05-10'),
 (11, 8, '2023-05-11'),
 (12, 9, '2023-05-12'),
 (13, 10, '2023-05-13'),
 (14, 11, '2023-05-14'),
 (15, 12, '2023-05-15'),
 (16, 13, '2023-05-16')]

In [ ]:
%%sql CREATE TABLE order_items (
    order_id INT,
    product_id INT,
    quantity
)

In [ ]:
%%sql INSERT INTO order_items (order_id, product_id, quantity) VALUES
    (1, 1, 2),
    (1, 2, 1),
    (2, 2, 1),
    (2, 3, 3),
    (3, 1, 1),
    (3, 3, 2),
    (4, 2, 4),
    (4, 3, 1),
    (5, 1, 1),
    (5, 3, 2),
    (6, 2, 3),
    (6, 1, 1),
    (7, 4, 1),
    (7, 5, 2),
    (8, 6, 3),
    (8, 7, 1),
    (9, 8, 2),
    (9, 9, 1),
    (10, 10, 3),
    (10, 11, 2),
    (11, 12, 1),
    (11, 13, 3),
    (12, 4, 2),
    (12, 5, 1),
    (13, 6, 3),
    (13, 7, 2),
    (14, 8, 1),
    (14, 9, 2),
    (15, 10, 3),
    (15, 11, 1),
    (16, 12, 2),
    (16, 13, 3);

In [18]:
%%sql SELECT *
FROM order_items

 * sqlite:////content/ABC_DATA.db
Done.

[(1, 1, 2),
 (1, 2, 1),
 (2, 2, 1),
 (2, 3, 3),
 (3, 1, 1),
 (3, 3, 2),
 (4, 2, 4),
 (4, 3, 1),
 (5, 1, 1),
 (5, 3, 2),
 (6, 2, 3),
 (6, 1, 1),
 (7, 4, 1),
 (7, 5, 2),
 (8, 6, 3),
 (8, 7, 1),
 (9, 8, 2),
 (9, 9, 1),
 (10, 10, 3),
 (10, 11, 2),
 (11, 12, 1),
 (11, 13, 3),
 (12, 4, 2),
 (12, 5, 1),
 (13, 6, 3),
 (13, 7, 2),
 (14, 8, 1),
 (14, 9, 2),
 (15, 10, 3),
 (15, 11, 1),
 (16, 12, 2),
 (16, 13, 3)]

Below is the product with the highest price

In [20]:
%%sql SELECT *
FROM products
ORDER BY price DESC
LIMIT 1;

 * sqlite:////content/ABC_DATA.db
Done.

[(13, 'Product M', 70)]

In [25]:
%%sql SELECT order_id
FROM order_items
GROUP BY order_id
ORDER BY SUM(quantity) DESC
LIMIT 1;

 * sqlite:////content/ABC_DATA.db
Done.

[(16,)]

In [23]:
%%sql SELECT MAX(price) AS highest_product_price FROM products;

 * sqlite:////content/ABC_DATA.db
Done.

[(70,)]

Which customer has made the most orders?

In [28]:
%%sql WITH order_counts AS (
    SELECT customer_id, COUNT(order_id) AS order_count
    FROM orders
    GROUP BY customer_id
),
max_order_count AS (
    SELECT MAX(order_count) AS max_count
    FROM order_counts
)
SELECT c.first_name, c.last_name
FROM customers c
JOIN order_counts oc ON c.customer_id = oc.customer_id
JOIN max_order_count moc ON oc.order_count = moc.max_count;

 * sqlite:////content/ABC_DATA.db
Done.

[('John', 'Doe'), ('Jane', 'Smith'), ('Bob', 'Johnson')]

What’s the total revenue per product?

In [29]:
%%sql SELECT p.product_name,
       p.price * SUM(oi.quantity) AS total_revenue
FROM products p
JOIN order_items oi ON oi.product_id = p.product_id
GROUP BY p.product_id, p.product_name, p.price
ORDER BY total_revenue DESC;

 * sqlite:////content/ABC_DATA.db
Done.

[('Product M', 420),
 ('Product J', 330),
 ('Product F', 210),
 ('Product L', 195),
 ('Product K', 180),
 ('Product C', 160),
 ('Product I', 150),
 ('Product B', 135),
 ('Product H', 135),
 ('Product G', 120),
 ('Product E', 90),
 ('Product D', 75),
 ('Product A', 50)]

Which customer has made the most orders?

In [30]:
%%sql WITH order_counts AS (
    SELECT customer_id, COUNT(order_id) AS order_count
    FROM orders
    GROUP BY customer_id
),
max_order_count AS (
    SELECT MAX(order_count) AS max_count
    FROM order_counts
)
SELECT c.first_name, c.last_name
FROM customers c
JOIN order_counts oc ON c.customer_id = oc.customer_id
JOIN max_order_count moc ON oc.order_count = moc.max_count;

 * sqlite:////content/ABC_DATA.db
Done.

[('John', 'Doe'), ('Jane', 'Smith'), ('Bob', 'Johnson')]

What’s the total revenue per product?

In [31]:
%%sql SELECT p.product_name,
       p.price * SUM(oi.quantity) AS total_revenue
FROM products p
JOIN order_items oi ON oi.product_id = p.product_id
GROUP BY p.product_id, p.product_name, p.price
ORDER BY total_revenue DESC;

 * sqlite:////content/ABC_DATA.db
Done.

[('Product M', 420),
 ('Product J', 330),
 ('Product F', 210),
 ('Product L', 195),
 ('Product K', 180),
 ('Product C', 160),
 ('Product I', 150),
 ('Product B', 135),
 ('Product H', 135),
 ('Product G', 120),
 ('Product E', 90),
 ('Product D', 75),
 ('Product A', 50)]